---
kind: method
id: M:Autodesk.Revit.DB.FilterCategoryRule.GetCategories
source: html/b6c50b64-8745-5453-44c3-726ea09b329c.htm
---
# Autodesk.Revit.DB.FilterCategoryRule.GetCategories Method

Gets the rule's categories.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetCategories()
```